app/controllers/articles_controller.rb

  def index
    @articles = Article.order("created_at DESC").page(params[:page]).per(10)
---
SELECT  `articles`.* FROM `articles` ORDER BY created_at DESC LIMIT 10 OFFSET 0
SELECT COUNT(*) FROM `articles`